{
    "name": "Ваш первый Реактор",
    "icon": "bigreactors:basic_reactorcasing",
    "category": "bigreactors:intro",

    "pages": [
        {
            "type": "text",
            "text": "Реактор - это многоблочная машина, производящая энергию в большом количестве.$(br2)Он состоит из множества различных блоков, которые вы будете ставить в мире рядом друг с другом.$(br2)Для создания и запуска Реактора, вам понадобятся Йеллориевые слитки, поэтому отправляйтесь добывать йеллориевую руду и сразу же переплавляйте её!"
        },
        {
            "type": "zcmultiblock",
            "multiblock_id" : "bigreactors:bookfirstbasicreactor"
        },
        {
            "type": "text",
            "text": "Чтобы построить свой первый реактор, вам необходимо создать следующие базовые блоки реактора:$(br2)$(li)22x корпуса$(li)1x контроллер$(li)1x регулирующий стержень$(li)1x топливный стержень$(li)1x порт доступа$(li)1x активный энергетический интерфейс$(br2)Блоки стекла являются необязательными и могут быть заменены корпусами."
        },
        {
            "type": "crafting2x",
            "title1": "Casing",
            "recipe1": "bigreactors:reactor/basic/casing",
            "title2": "Glass",
            "recipe2": "bigreactors:reactor/basic/glass"
        },
        {
            "type": "crafting2x",
            "title1": "Controller",
            "recipe1": "bigreactors:reactor/basic/controller_ingots_uranium",
            "title2": "Control Rod",
            "recipe2": "bigreactors:reactor/basic/controlrod"
        },
        {
            "type": "crafting2x",
            "title1": "Fuel Rod",
            "recipe1": "bigreactors:reactor/basic/fuelrod_ingots_uranium",
            "title2": "Access Port",
            "recipe2": "bigreactors:reactor/basic/solidaccessport"
        },
        {
            "type": "crafting-text",
            "title": "Forge Power Tap",
            "recipe": "bigreactors:reactor/basic/activetap_fe",
            "text": "После того как вы создали все необходимые блоки, вы готовы построить свой первый Реактор.$(br2)Поставьте блоки в своём мире по следующей схеме, поместив Топливный Стержень в центр с корпусом ниже."
        },
        {
            "type": "zcmultiblock",
            "multiblock_id" : "bigreactors:bookfirstbasicreactor"
        },
        {
            "type": "text",
            "text": "Если всё идёт хорошо, то после установки последнего блока сформируется Реактор, и вы сможете открыть его интерфейс через Контроллер, нажав правой кнопкой мыши по нему.$(br2)Если ничего не происходит, нажмите правой кнопкой мыши по любому установленному блоку: Вы получите сообщение об ошибке, которое должно объяснить, в чём проблема. Как только вы это исправите, вас должен ждать сформированный Реактор или другое сообщение об ошибке."
        },
        {
            "type": "text",
            "text": "Теперь, когда ваш реактор готов, пришло время добавить в него немного топлива.$(br2)Возмите побольше Йеллориевых слитков и нажмите ПКМ по порту доступа. Установите порт в режим ввода и поместите слитки во входной слот.$(br2)Слитки будут быстро потребляться Реактором и превращаться в топливо.$(br2)Откройте интерфейс через Контроллер и запустите ваш РЕАКТОР!!!"
        },
        {
            "type": "text",
            "text": "По мере нагрева Реактора, энергия медленно вырабается и заполняет внутренний энергетический буфер.$(br2)Чтобы использовать энергию, запасённую внутри реактора, вам нужно подключить какую-нибудь энергетическую трубу или машину к Активному Энергетическому интерфейсу.$(br)Энергетический Интерфейс будет передавать энергию на подключенный блок (если он может её принять)."
        },
        {
            "type": "text",
            "text": "Поздравляем, вы построили свой первый Реактор!$(br2)Используйте его, чтобы генерировать много энергии, которая необходима для ваших потребностей в начале игры, и переходите к строительству других реакторов и турбин после прочтения оставшейся части этого руководства."
        }
    ]
}